# -*- coding:utf-8 -*-
# 变量：是一个将程序运行的中间结果临时存放在内存中，以便后续调用。

# 1、1变量名定义:
"""
    a、数字\字母\下划线,的任意组合,且不能是数字开头。
    b、不能是python中的关键字
    c、变量名称尽量做到见名知意
"""

# 作业：
# 判断下面哪些是正确的变量名称
# 1、t-t = 2    不能是中横线，这个是代表减号的意思
# 2、3t_t = 3   不能是数字开头
# 3、*r= 4      不能是*号
_ = 'fas'       #正确
# 5、__ _ = b   不能中间有空格
# 6、%- = 'fasd'不能有百分号
# 7、2w = 5     不能是数字开头
# 8、qwe-r = y  不能是中横线，这个是代表减号的意思
# python推荐变量名的命名方式为：
age_old_boy = 25
# 也可以使用驼峰体
AgeOldBoy = 25

# 1、2变量的赋值
age_old_girl = 25
age1 = 12
age2 = age1
age3 = age2
age2 = 100
print(age1,age2,age3)   #12,100,12






